# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.

In [2]:
#Your code here
c.execute(' SELECT e.firstNAME, e.lastNAME FROM employees e JOIN offices o USING(officeCode) WHERE o.city = "Boston"; ').fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [3]:
#Your code here
c.execute('SELECT o.city FROM offices o LEFT JOIN employees e USING(officeCode) where e.officeCode IS NULL;').fetchall()

[]

## Write 3 Questions of your own and answer them

In [4]:
# Answers will vary
# 1. Which Customer has placed the most orders?
# 2. Which Customer has sent in the most money in payments?
# 3. Which office has the most employees?

In [5]:
c.execute('SELECT COUNT(*) FROM customers where customerNumber = "141";').fetchall()
# c.execute('SELECT * FROM customers c where c.CustomerName = "Kelly\'s Gift Shop"').fetchall()

[(1,)]

In [6]:
# Your code here
c.execute('SELECT c.customerName, o.customerNumber, COUNT(o.orderNumber) FROM orders o INNER JOIN customers c ON c.CustomerNumber = CAST(o.CustomerNumber AS INT) GROUP BY o.customerNumber ORDER BY 3 DESC LIMIT 10;').fetchall()

[('Euro+ Shopping Channel', '141', 26),
 ('Mini Gifts Distributors Ltd.', '124', 17),
 ('Australian Collectors, Co.', '114', 5),
 ('Danish Wholesale Imports', '145', 5),
 ('Dragon Souveniers, Ltd.', '148', 5),
 ('Down Under Souveniers, Inc', '323', 5),
 ('Reims Collectables', '353', 5),
 ('La Rochelle Gifts', '119', 4),
 ('Baane Mini Imports', '121', 4),
 ('Blauer See Auto, Co.', '128', 4)]

In [7]:
# Your code here
c.execute('SELECT c.customerName, CAST(p.customerNumber AS INT), round(Sum(p.amount), 2) FROM payments p INNER JOIN customers c ON CAST(c.customerNumber AS INT) = CAST(p.customerNumber as INT) GROUP BY CAST(p.customerNumber as INT) ORDER BY 3 DESC LIMIT 5;').fetchall()

[('Euro+ Shopping Channel', 141, 715738.98),
 ('Mini Gifts Distributors Ltd.', 124, 584188.24),
 ('Australian Collectors, Co.', 114, 180585.07),
 ('Muscle Machine Inc', 151, 177913.95),
 ('Dragon Souveniers, Ltd.', 148, 156251.03)]

In [8]:
# Your code here
c.execute('SELECT o.City, count(e.EmployeeNumber) FROM offices o INNER JOIN employees e on cast(o.officeCode AS INT) = cast(e.officeCode AS INT) GROUP BY o.officeCode ORDER BY 2 DESC;').fetchall()

[('San Francisco', 6),
 ('Paris', 5),
 ('Sydney', 4),
 ('Boston', 2),
 ('NYC', 2),
 ('Tokyo', 2),
 ('London', 2)]

## Level Up: Display the names of each product each employee has sold.

In [11]:
# Your code here
c.execute('''
SELECT DISTINCT e.firstName, e.lastName, e.EmployeeNumber,pdt.ProductName 
FROM employees e           
JOIN customers c on e.EmployeeNumber = c.salesRepEmployeeNumber
JOIN orders o USING(customerNumber)
JOIN orderdetails od USING(orderNumber)
JOIN products pdt USING(productCode)
GROUP BY pdt.productCode;
''').fetchall()

[('Peter', 'Marsh', '1612', '1969 Harley Davidson Ultimate Chopper'),
 ('Martin', 'Gerard', '1702', '1952 Alpine Renault 1300'),
 ('Mami', 'Nishi', '1621', '1996 Moto Guzzi 1100i'),
 ('Mami', 'Nishi', '1621', '2003 Harley-Davidson Eagle Drag Bike'),
 ('Martin', 'Gerard', '1702', '1972 Alfa Romeo GTA'),
 ('Martin', 'Gerard', '1702', '1962 LanciaA Delta 16V'),
 ('Martin', 'Gerard', '1702', '1968 Ford Mustang'),
 ('Martin', 'Gerard', '1702', '2001 Ferrari Enzo'),
 ('Martin', 'Gerard', '1702', '1958 Setra Bus'),
 ('Peter', 'Marsh', '1612', '2002 Suzuki XREO'),
 ('Martin', 'Gerard', '1702', '1969 Corvair Monza'),
 ('Martin', 'Gerard', '1702', '1968 Dodge Charger'),
 ('Martin', 'Gerard', '1702', '1969 Ford Falcon'),
 ('Martin', 'Gerard', '1702', '1970 Plymouth Hemi Cuda'),
 ('Martin', 'Gerard', '1702', '1957 Chevy Pickup'),
 ('Martin', 'Gerard', '1702', '1969 Dodge Charger'),
 ('Martin', 'Gerard', '1702', '1940 Ford Pickup Truck'),
 ('Martin', 'Gerard', '1702', '1993 Mazda RX-7'),
 ('Peter', 'Marsh', '1612', '1937 Lincoln Berline'),
 ('Martin', 'Gerard', '1702', '1936 Mercedes-Benz 500K Special Roadster'),
 ('Peter', 'Marsh', '1612', '1965 Aston Martin DB5'),
 ('Mami', 'Nishi', '1621', '1980s Black Hawk Helicopter'),
 ('Martin', 'Gerard', '1702', '1917 Grand Touring Sedan'),
 ('Martin', 'Gerard', '1702', '1948 Porsche 356-A Roadster'),
 ('Martin', 'Gerard', '1702', '1995 Honda Civic'),
 ('Martin', 'Gerard', '1702', '1998 Chrysler Plymouth Prowler'),
 ('Martin', 'Gerard', '1702', '1911 Ford Town Car'),
 ('Martin', 'Gerard', '1702', '1964 Mercedes Tour Bus'),
 ('Martin', 'Gerard', '1702', '1932 Model A Ford J-Coupe'),
 ('Martin', 'Gerard', '1702', '1926 Ford Fire Engine'),
 ('Mami', 'Nishi', '1621', 'P-51-D Mustang'),
 ('Mami', 'Nishi', '1621', '1936 Harley Davidson El Knucklehead'),
 ('Martin', 'Gerard', '1702', '1928 Mercedes-Benz SSK'),
 ('Martin', 'Gerard', '1702', '1999 Indy 500 Monte Carlo SS'),
 ('Martin', 'Gerard', '1702', '1913 Ford Model T Speedster'),
 ('Martin', 'Gerard', '1702', '1934 Ford V8 Coupe'),
 ('Martin', 'Gerard', '1702', '1999 Yamaha Speed Boat'),
 ('Martin', 'Gerard', '1702', '18th Century Vintage Horse Carriage'),
 ('Martin', 'Gerard', '1702', '1903 Ford Model A'),
 ('Martin', 'Gerard', '1702', '1992 Ferrari 360 Spider red'),
 ('Martin', 'Gerard', '1702', 'Collectable Wooden Train'),
 ('Martin', 'Gerard', '1702', '1969 Dodge Super Bee'),
 ('Martin', 'Gerard', '1702', '1917 Maxwell Touring Car'),
 ('Martin', 'Gerard', '1702', '1976 Ford Gran Torino'),
 ('Martin', 'Gerard', '1702', '1948 Porsche Type 356 Roadster'),
 ('Mami', 'Nishi', '1621', '1957 Vespa GS150'),
 ('Martin', 'Gerard', '1702', '1941 Chevrolet Special Deluxe Cabriolet'),
 ('Mami', 'Nishi', '1621', '1970 Triumph Spitfire'),
 ('Peter', 'Marsh', '1612', '1932 Alfa Romeo 8C2300 Spider Sport'),
 ('Martin', 'Gerard', '1702', '1904 Buick Runabout'),
 ('Martin', 'Gerard', '1702', '1940s Ford truck'),
 ('Martin', 'Gerard', '1702', '1939 Cadillac Limousine'),
 ('Martin', 'Gerard', '1702', '1957 Corvette Convertible'),
 ('Peter', 'Marsh', '1612', '1957 Ford Thunderbird'),
 ('Peter', 'Marsh', '1612', '1970 Chevy Chevelle SS 454'),
 ('Martin', 'Gerard', '1702', '1970 Dodge Coronet'),
 ('Mami', 'Nishi', '1621', '1997 BMW R 1100 S'),
 ('Peter', 'Marsh', '1612', '1966 Shelby Cobra 427 S/C'),
 ('Mami', 'Nishi', '1621', '1928 British Royal Navy Airplane'),
 ('Martin', 'Gerard', '1702', '1939 Chevrolet Deluxe Coupe'),
 ('Martin', 'Gerard', '1702', '1960 BSA Gold Star DBD34'),
 ('Martin', 'Gerard', '1702', '18th century schooner'),
 ('Martin', 'Gerard', '1702', '1938 Cadillac V-16 Presidential Limousine'),
 ('Martin', 'Gerard', '1702', '1962 Volkswagen Microbus'),
 ('Mami', 'Nishi', '1621', '1982 Ducati 900 Monster'),
 ('Peter', 'Marsh', '1612', '1949 Jaguar XK 120'),
 ('Martin', 'Gerard', '1702', '1958 Chevy Corvette Limited Edition'),
 ('Mami', 'Nishi', '1621', '1900s Vintage Bi-Plane'),
 ('Peter', 'Marsh', '1612', '1952 Citroen-15CV'),
 ('Martin', 'Gerard', '1702', '1982 Lamborghini Diablo'),
 ('Martin', 'Gerard', '1702', '1912 Ford Model T Delivery Wagon'),
 ('Peter', 'Marsh', '1612', '1969 Chevrolet Camaro Z28'),
 ('Martin', 'Gerard', '1702', '1971 Alpine Renault 1600s'),
 ('Mami', 'Nishi', '1621', '1937 Horch 930V Limousine'),
 ('Peter', 'Marsh', '1612', '2002 Chevy Corvette'),
 ('Martin', 'Gerard', '1702', '1940 Ford Delivery Sedan'),
 ('Martin', 'Gerard', '1702', '1956 Porsche 356A Coupe'),
 ('Mami', 'Nishi', '1621', 'Corsair F4U ( Bird Cage)'),
 ('Martin', 'Gerard', '1702', '1936 Mercedes Benz 500k Roadster'),
 ('Martin', 'Gerard', '1702', '1992 Porsche Cayenne Turbo Silver'),
 ('Martin', 'Gerard', '1702', '1936 Chrysler Airflow'),
 ('Martin', 'Gerard', '1702', '1900s Vintage Tri-Plane'),
 ('Martin', 'Gerard', '1702', '1961 Chevrolet Impala'),
 ('Martin', 'Gerard', '1702', '1980â€™s GM Manhattan Express'),
 ('Martin', 'Gerard', '1702', '1997 BMW F650 ST'),
 ('Mami', 'Nishi', '1621', '1982 Ducati 996 R'),
 ('Martin', 'Gerard', '1702', '1954 Greyhound Scenicruiser'),
 ('Martin', 'Gerard', '1702', "1950's Chicago Surface Lines Streetcar"),
 ('Martin', 'Gerard', '1702', '1996 Peterbilt 379 Stake Bed with Outrigger'),
 ('Martin', 'Gerard', '1702', '1928 Ford Phaeton Deluxe'),
 ('Mami', 'Nishi', '1621', '1974 Ducati 350 Mk3 Desmo'),
 ('Martin', 'Gerard', '1702', '1930 Buick Marquette Phaeton'),
 ('Martin', 'Gerard', '1702', 'Diamond T620 Semi-Skirted Tanker'),
 ('Mami', 'Nishi', '1621', '1962 City of Detroit Streetcar'),
 ('Mami', 'Nishi', '1621', '2002 Yamaha YZR M1'),
 ('Martin', 'Gerard', '1702', 'The Schooner Bluenose'),
 ('Martin', 'Gerard', '1702', 'American Airlines: B767-300'),
 ('Martin', 'Gerard', '1702', 'The Mayflower'),
 ('Martin', 'Gerard', '1702', 'HMS Bounty'),
 ('Martin', 'Gerard', '1702', 'America West Airlines B757-200'),
 ('Martin', 'Gerard', '1702', 'The USS Constitution Ship'),
 ('Martin', 'Gerard', '1702', '1982 Camaro Z28'),
 ('Martin', 'Gerard', '1702', 'ATA: B757-300'),
 ('Mami', 'Nishi', '1621', 'F/A 18 Hornet 1/72'),
 ('Martin', 'Gerard', '1702', 'The Titanic'),
 ('Martin', 'Gerard', '1702', 'The Queen Mary'),
 ('Mami', 'Nishi', '1621', 'American Airlines: MD-11S'),
 ('Martin', 'Gerard', '1702', 'Boeing X-32A JSF'),
 ('Martin', 'Gerard', '1702', 'Pont Yacht')]

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!